# PANDAS

In [ ]:
#pandas=local source library
#pandas===>it is an open source library that is used for handle data manipulatio
#dat structure:
#(1).Series (2).DataFrame

In [3]:
#Series
import pandas as pd
a=pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [6]:
#DataFrame
a={
    "emp_id":[1,2,3,4,5],
    "Name":['dolly','dev','mohit','vansh','arpita'],
    "Department":['IT','HR','IT','HR','HR'],
    "Working_hours":[2,5,7,4,3]
}
df=pd.DataFrame(a)
df

   emp_id    Name Department  Working_hours
0       1   dolly         IT              2
1       2     dev         HR              5
2       3   mohit         IT              7
3       4   vansh         HR              4
4       5  arpita         HR              3

In [9]:
df.columns

Index(['emp_id', 'Name', 'Department', 'Working_hours'], dtype='object')

In [10]:
df.head()   #it returns top datas

   emp_id    Name Department  Working_hours
0       1   dolly         IT              2
1       2     dev         HR              5
2       3   mohit         IT              7
3       4   vansh         HR              4
4       5  arpita         HR              3

In [11]:
df.head(2)

   emp_id   Name Department  Working_hours
0       1  dolly         IT              2
1       2    dev         HR              5

In [12]:
df.tail()     #it returns bottom datas

   emp_id    Name Department  Working_hours
0       1   dolly         IT              2
1       2     dev         HR              5
2       3   mohit         IT              7
3       4   vansh         HR              4
4       5  arpita         HR              3

In [13]:
df.tail(2)    #it returns botton 2 datas

   emp_id    Name Department  Working_hours
3       4   vansh         HR              4
4       5  arpita         HR              3

In [14]:
df.sample(4)    #it return random indexed row

   emp_id    Name Department  Working_hours
0       1   dolly         IT              2
4       5  arpita         HR              3
2       3   mohit         IT              7
3       4   vansh         HR              4

In [15]:
df.describe()    # it returns statically view of data

         emp_id  Working_hours
count  5.000000       5.000000
mean   3.000000       4.200000
std    1.581139       1.923538
min    1.000000       2.000000
25%    2.000000       3.000000
50%    3.000000       4.000000
75%    4.000000       5.000000
max    5.000000       7.000000

In [16]:
df.info()     #complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   emp_id         5 non-null      int64
 1   Name           5 non-null      object
 2   Department     5 non-null      object
 3   Working_hours  5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

# if you want to explort your data into excel

In [17]:
df.to_csv("C:\\Users\\us\\OneDrive\\Desktop\\regexml\\Emp_info.csv")

In [18]:
df.to_csv("C:\\Users\\us\\OneDrive\\Desktop\\regexml\\new_Emp_info.csv",index=False)

# how to read csv file into jupyter notebook

In [19]:
df=pd.read_csv("C:\\Users\\us\\OneDrive\\Desktop\\regexml\\Emp_info.csv")

In [20]:
df.head()

   Unnamed: 0  emp_id    Name Department  Working_hours
0           0       1   dolly         IT              2
1           1       2     dev         HR              5
2           2       3   mohit         IT              7
3           3       4   vansh         HR              4
4           4       5  arpita         HR              3

In [21]:
#find how many types of department and total no.
df['Department'].value_counts()

HR    3
IT    2
Name: Department, dtype: int64

In [22]:
df['Name'][0:4]

0    dolly
1      dev
2    mohit
3    vansh
Name: Name, dtype: object

In [23]:
df['Name'][0]='himanshi'

<ipython-input-23-497dcc51a03c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0]='himanshi'

In [24]:
df.head

<bound method NDFrame.head of    Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5
2           2       3     mohit         IT              7
3           3       4     vansh         HR              4
4           4       5    arpita         HR              3>

In [25]:
df['Working_hours'][4]=7

<ipython-input-25-682960599175>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_hours'][4]=7

In [26]:
df.head()

   Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5
2           2       3     mohit         IT              7
3           3       4     vansh         HR              4
4           4       5    arpita         HR              7

# LOC AND ILOC

In [27]:
#df.loc("row_range","column_rabge")
#df.iloc("row_range,column_range")

In [28]:
df.loc[2]

Unnamed: 0           2
emp_id               3
Name             mohit
Department          IT
Working_hours        7
Name: 2, dtype: object

In [29]:
df.loc[2:5,["Name","Department"]]

     Name Department
2   mohit         IT
3   vansh         HR
4  arpita         HR

df.loc[2:5]

In [35]:
df.loc[0:4]

   Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5
2           2       3     mohit         IT              7
3           3       4     vansh         HR              4
4           4       5    arpita         HR              7

In [30]:
df.iloc[2]

Unnamed: 0           2
emp_id               3
Name             mohit
Department          IT
Working_hours        7
Name: 2, dtype: object

In [34]:
df.iloc[0:4]

   Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5
2           2       3     mohit         IT              7
3           3       4     vansh         HR              4

In [33]:
df.iloc[2:5,1:3]

   emp_id    Name
2       3   mohit
3       4   vansh
4       5  arpita

In [36]:
df['Name'][2]=None

<ipython-input-36-9b068a382b98>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2]=None

In [37]:
df['Department'][4]=None
df['Department'][3]=None

<ipython-input-37-b4c601be1cca>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4]=None
<ipython-input-37-b4c601be1cca>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3]=None

In [38]:
df

   Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5
2           2       3      None         IT              7
3           3       4     vansh       None              4
4           4       5    arpita       None              7

In [39]:
df.isnull()  #it will return true if you have misiing values otherwise it return false

   Unnamed: 0  emp_id   Name  Department  Working_hours
0       False   False  False       False          False
1       False   False  False       False          False
2       False   False   True       False          False
3       False   False  False        True          False
4       False   False  False        True          False

In [40]:
df.isnull().sum()   #we can check total missing values frfom a datframe

Unnamed: 0       0
emp_id           0
Name             1
Department       2
Working_hours    0
dtype: int64

In [41]:
df.dropna()   #it delete all row and columns from out data which is null in out data

   Unnamed: 0  emp_id      Name Department  Working_hours
0           0       1  himanshi         IT              2
1           1       2       dev         HR              5